code/Transbank/Webpay/logs/webpay-2017-06-17.txt

05:49:40 - datos request initTransaction 
Array
(
    [wSTransactionType] => TR_MALL_WS
    [commerceId] => 597020000542
    [buyOrder] => 000000142
    [sessionId] => 
    [returnURL] => http://sm-dev.xpectrumtech.com/webpay/payment/response
    [finalURL] => http://sm-dev.xpectrumtech.com/webpay/payment/success
    [transactionDetails] => Array
        (
            [commerceCode] => 597020000543
            [buyOrder] => 000000142
            [amount] => 10034
        )

)

05:49:42 - initTransaction request  - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-651250"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-651249"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>Dp1bNWmzp1jYqhZ2Z6h3PxOkpvM=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>c3gTBKnTCnSNcbPW2GWZHU8qDEqDqr2vs7t/0yfTGeVzRQek5DJPKDptMOTU59KA4yHxsL+VcU1D
Awzbrua5XAyNvLgblK/QBp3HIpa2ffYCRqIrsLehh4mYx2Zygme27QdTx4bZBJ7CbUheUXGrgAqt
fLU6gj/JiJz0ZB+QrnLF6+B1m6XfjyenfOdUt97wo2pOZYwxt7nY32A2sxZdFsbGEi4cGmwm18ty
d3G15ATsw/s191i+LnoqwA1+RR6S4L25HKf3YwxTuqAgDEZs8d09FSLTOiXyHIpA436sXl54/xD/
g6keOVt1cnSUaCJF1r6vzyrZaAh3+u4AcWMbhQ==</ds:SignatureValue><ds:KeyInfo Id="KI-530FDA96CA813639981497678581526977048"><wsse:SecurityTokenReference wsu:Id="STR-530FDA96CA813639981497678581526977049"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-651249"><ns2:initTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><token>e5daae0cb6f148d14e6d4e68cce65f300285816b09b5d2f0f54941b25cb4e658</token><url>https://webpay3gint.transbank.cl/filtroUnificado/initTransaction</url></return></ns2:initTransactionResponse></soap:Body></soap:Envelope>

05:49:42 - initTransaction response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-651250"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-651249"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>Dp1bNWmzp1jYqhZ2Z6h3PxOkpvM=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>c3gTBKnTCnSNcbPW2GWZHU8qDEqDqr2vs7t/0yfTGeVzRQek5DJPKDptMOTU59KA4yHxsL+VcU1D
Awzbrua5XAyNvLgblK/QBp3HIpa2ffYCRqIrsLehh4mYx2Zygme27QdTx4bZBJ7CbUheUXGrgAqt
fLU6gj/JiJz0ZB+QrnLF6+B1m6XfjyenfOdUt97wo2pOZYwxt7nY32A2sxZdFsbGEi4cGmwm18ty
d3G15ATsw/s191i+LnoqwA1+RR6S4L25HKf3YwxTuqAgDEZs8d09FSLTOiXyHIpA436sXl54/xD/
g6keOVt1cnSUaCJF1r6vzyrZaAh3+u4AcWMbhQ==</ds:SignatureValue><ds:KeyInfo Id="KI-530FDA96CA813639981497678581526977048"><wsse:SecurityTokenReference wsu:Id="STR-530FDA96CA813639981497678581526977049"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-651249"><ns2:initTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><token>e5daae0cb6f148d14e6d4e68cce65f300285816b09b5d2f0f54941b25cb4e658</token><url>https://webpay3gint.transbank.cl/filtroUnificado/initTransaction</url></return></ns2:initTransactionResponse></soap:Body></soap:Envelope>

05:50:33 - transactionResult request  - <?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://service.wswebpay.webpay.transbank.com/"><SOAP-ENV:Body><ns1:getTransactionResult><tokenInput>e5daae0cb6f148d14e6d4e68cce65f300285816b09b5d2f0f54941b25cb4e658</tokenInput></ns1:getTransactionResult></SOAP-ENV:Body></SOAP-ENV:Envelope>

05:50:33 - transactionResult response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-651252"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-651251"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>8HOjMnkHy4vuQNPUkCMRjHTtbHw=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>J6bXo2XrOoJckSYVLrkDB5eVnzVYZd87j88sATlcFprat1BdaU7cAyd8CxEiV8TPfgyjBgqWrBg/
Qd+Ml35YQSCAQ7/b9PPThmPYb/kEVHFXNDEuSG8CMKcJsAsbbLDMVIzpL4PyhgJqfRMGhH7lkEkU
qawzfcpmJi/uE7166T+jwjknrMzuN92elCZImOtt3eLZ2Z0ZdcN5+EHT3PXytCA4XjPdq7369rkC
w6/Ns0G63hHhDVgozcYNurGQLTMMMSXVbfUZ08/ZRrXqzOoVTtj+czoqBjXJwK4o6l9M6FAMORW1
nrRUoDApnzooXbPz7Amdx0Kxh5Nr9eGWMgYQvQ==</ds:SignatureValue><ds:KeyInfo Id="KI-530FDA96CA813639981497678633330977051"><wsse:SecurityTokenReference wsu:Id="STR-530FDA96CA813639981497678633330977052"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-651251"><ns2:getTransactionResultResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"><return><accountingDate>0617</accountingDate><buyOrder>000000142</buyOrder><cardDetail><cardNumber>6623</cardNumber></cardDetail><detailOutput><sharesNumber>0</sharesNumber><amount>10034</amount><commerceCode>597020000543</commerceCode><buyOrder>000000142</buyOrder><authorizationCode>1213</authorizationCode><paymentTypeCode>VN</paymentTypeCode><responseCode>0</responseCode></detailOutput><transactionDate>2017-06-17T01:49:38.965-04:00</transactionDate><urlRedirection>https://webpay3gint.transbank.cl/filtroUnificado/voucher.cgi</urlRedirection><VCI>TSY</VCI></return></ns2:getTransactionResultResponse></soap:Body></soap:Envelope>

05:50:35 - acknowledgeTransaction request  - <?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://service.wswebpay.webpay.transbank.com/"><SOAP-ENV:Body><ns1:acknowledgeTransaction><tokenInput>e5daae0cb6f148d14e6d4e68cce65f300285816b09b5d2f0f54941b25cb4e658</tokenInput></ns1:acknowledgeTransaction></SOAP-ENV:Body></SOAP-ENV:Envelope>

05:50:35 - acknowledgeTransaction response - <?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-651254"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-651253"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>q/JyFYdXwwlIYKBkrvuq8nqC4IA=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>LSrWK0K1MZqHsCjSi6ZttodqsUloVC/oEy/B5b/r+KKu2r+HZZBGJLr7xcflIQD3IngMYJXQ022x
RkYEP/3HAXjpC7X4Qx72mVhL8LCUmxt2xkXj3/FkPFRt5C2PuQeWluJnYcKpUZpeKQ3SGENGuVZh
FD2++RMlTIgdrxXaAH3aei/h7uwiKilFc4y0zy0rcSDKWvbFFYehCSXFI+kGY5RIOzpC3gmxj+12
ds5j/6PCE5weUeyiC3X0ssCTNABi2282j5dOQhun/cxpL1ItmC+FA43nzK86a/brRuUvU0ckmuW9
9QtXrl2rnnyvejtxtEAJ4liTOpDuL5kJnHKbUA==</ds:SignatureValue><ds:KeyInfo Id="KI-530FDA96CA813639981497678634943977054"><wsse:SecurityTokenReference wsu:Id="STR-530FDA96CA813639981497678634943977055"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=10,OU=kdu,O=kdu,L=Santiago,ST=Chile,C=CL</ds:X509IssuerName><ds:X509SerialNumber>1449520866</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-651253"><ns2:acknowledgeTransactionResponse xmlns:ns2="http://service.wswebpay.webpay.transbank.com/"/></soap:Body></soap:Envelope>

